{
    "0": {
        "responsibilities": [
            "Designed, developed, and deployed high-traffic Housing Hackathon website using React, JavaScript, and Firebase, increasing website efficiency by 80% for 500+ teams and ensuring seamless cross-device user performance.",
            "Achieved 100% cross-platform compatibility and responsiveness by designing with Tailwind CSS, optimizing the user experience across 15+ device types and browsers.",
            "Improved project delivery speed by 40% through agile methodologies, collaborating with 3 different teams, and integrating quality assurance practices, ensuring timely delivery and minimizing post-release issues."
        ]
    },
    "1": {
        "responsibilities": [
            "Boosted Instagram followers by creating visually appealing promotional materials for Party Room events using Canva, Figma and Adobe, which effectively communicated brand identity and attracted a larger audience.",
            "Enhanced design relevance by 40% through targeted market research to understand the preferences of the target audience, leading to more tailored and effective design concepts that resonated well with event attendees.",
            "Reduced design turnaround time by 25% by implementing agile workflows and collaborative tools, ensuring timely release of promotional content across multiple platforms."
        ]
    },
    "2": {
        "responsibilities": [
            "Assisted in the daily operation of the unit, including the support of daily administrative affairs and efficient paperwork processing, ensuring smooth daily operations.",
            "Implemented simple IT training tools to support technology adoption for 100+ users, focusing on creating accessible and user-friendly interfaces that improved user engagement by 50%.",
            "Enhanced community program reaches by 40% by conducting data analysis on 200+ user interactions and optimizing outreach strategies, resulting in broader user engagement and a 25% increase in attendance."
        ]
    },
    "3": {
        "responsibilities": [
            "Improved food safety compliance by 95% by executing safety audits based on HACCP and ISO22000 standards.",
            "Reduced quality issues by 30% through developing detailed quality reports, test plans, and implementing corrective actions in collaboration with cross-functional teams."
        ]
    },
    "4": {
        "responsibilities": [
            "Enhanced patient record accuracy by 40% by implementing a new system for managing medical records.",
            "Contributed to 3 academic publications within 6 months by assisting in research projects, grading fundus photographs, and performing data analysis."
        ]
    },
    "5": {
        "responsibilities": [
            "Improved patient dietary compliance by 25% through conducting personalized health assessments and providing tailored dietary advice",
            "Increased engagement with nutrition-related materials by 35% by creating informative and visually appealing promotional content based on collected and analyzed data.",
            "Assisted the dietitian in various research projects, providing critical support and insights into food and nutritional aspects, driving forward the department’s research initiatives."
        ]
    },
    "6": {
        "responsibilities": [
            "Reduced bacterial contamination incidents by 50% by executing comprehensive food quality control experiments, including bacterial enumeration and detection.",
            "Improved factory sanitation standards compliance by 40% through overseeing daily sample collection and implementing stricter quality assurance protocols."
        ]
    }
}